# Homebrew Bundle file for macOS setup
# Contains only explicitly installed packages (no dependencies)
# Generated with: brew leaves and brew list --cask
# Run with: brew bundle --file=Brewfile

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "bufbuild/buf"
tap "cargo-lambda/cargo-lambda"
tap "chiselstrike/tap"
tap "getsentry/tools"
tap "koekeishiya/formulae"

# Essential CLI Tools
brew "bash"
brew "rsync"
brew "wget"

# Version Control & Git Tools
brew "git"
brew "gh"
brew "lazygit"
brew "pre-commit"

# Development Tools & Compilers
brew "cmake"
brew "llvm"

# Programming Languages & Runtimes
brew "go"
brew "python@3.11"
brew "ruby"
brew "r"

# Python Development
brew "pipx"
brew "poetry"

# JavaScript/Node.js Development
brew "nvm"

# Database & Data Tools
brew "dbmate"

# Cloud & DevOps
brew "aws-sam-cli"
brew "terraform"
brew "tfenv"

# Container & Virtualization
brew "colima"
brew "qemu"

# Build & Package Management
brew "maven"
brew "cargo-lambda/cargo-lambda/cargo-lambda"

# Text Processing & Search
brew "fd"
brew "jq"
brew "pandoc"
brew "the_silver_searcher"

# Network Tools
brew "caddy"
brew "cloudflared"
brew "dnsmasq"
brew "httpie"
brew "mkcert"
brew "nginx"

# Security Tools
brew "oasdiff"

# Media & Graphics
brew "exiftool"
brew "ghostscript"
brew "imagemagick"

# Text Editors & Terminal
brew "fish"
brew "neovim"
brew "tmux"

# System Utilities
brew "htop"
brew "pv"
brew "terminal-notifier"
brew "watch"
brew "watchman"

# Development Tools
brew "act"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "balena-cli"
brew "bufbuild/buf/buf"
brew "chiselstrike/tap/turso"
brew "cookiecutter"
brew "dhex"
brew "getsentry/tools/sentry-wizard"
brew "gomplate"
brew "guile"
brew "jsonschema"
brew "just"
brew "koekeishiya/formulae/skhd"
brew "mvfst"
brew "openapi-generator"
brew "pdftk-java"
brew "pillow"
brew "pkl"
brew "poppler"
brew "protobuf"
brew "sc-im"
brew "virtualenv"
brew "yt-dlp"
brew "zlib"

# Cask Applications (GUI Apps)
cask "anaconda"
cask "bitwarden"
cask "calibre4"
cask "docker"
cask "docker-desktop"
cask "dynamodb-local"
cask "emacs"
cask "emacs-app"
cask "iterm2"
cask "jet"
cask "temurin"
cask "tomatobar"
brew "transmission-nightly"
brew "transmission@nightly"
cask "vlc"

# Mac App Store Apps (requires 'mas' CLI)
# Uncomment and add your apps:
# mas "Xcode", id: 497799835
# mas "1Password 7", id: 1333542190
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
